{
    "personalQuestions": [
        "Could you tell me a little bit about your background and any previous experience?",
        "What technical skills do you possess that are relevant to this role?",
        "Describe a time when you had to work with a difficult team member.",
        "How do you approach working under tight deadlines?",
        "How do you prioritize your tasks and manage your time effectively?",
        "How do you handle failure or mistakes in your work?",
        "What motivates you in your work?",
        "Can you describe a time when you had to overcome a difficult personal challenge?",
        "How do you balance work and personal life?",
        "Can you give an example of a time when you demonstrated leadership skills?",
        "How do you handle stress and pressure?",
        "Can you tell me about yourself in four sentences?",
        "What are your long-term career goals?",
        "What are your strengths and weaknesses?",
        "How do you stay organized and manage your time effectively?",
        "Can you tell me about a time when you had to make a tough decision? How did you come to your decision?",
        "Tell me about a project or accomplishment that you're particularly proud of. What did you learn from the experience?",
        "Describe a situation where you had to handle conflict with a customer or client. How did you handle the situation?",
        "How do you handle conflict or disagreement with managers or supervisors?",
        "Describe a time when you had to adapt to a change in project scope or direction.",
        "Tell me about a time when you had to manage multiple competing priorities. How did you prioritize your work?",
        "Describe a work environment or culture that you thrive in. What qualities do you look for in company culture?",
        "How do you stay up-to-date with changing industry trends and new technologies?",
        "Can you tell me about a time when you had to adapt to a new company culture or work environment? How did you approach this transition?",
        "How would you measure success in a role or at a company?",
        "How do you approach teamwork and collaboration in a development project?",
        "What are you most proud of in your career so far?",
        "What is your most significant accomplishment?",
        "Tell me about an important lesson you learned in your life.",
        "What are your most important personal values?",
        "What is your preferred communication style when working with team members or supervisors?",
        "SEPARATOR",
        "How do you approach problem-solving and decision-making?",
        "What's your approach to learning new technologies?",
        "What is the difference between a relational (SQL) database and a non-relational (NoSQL) database?",
        "What is a design pattern and can you give an example of one?",
        "What is Git and how does it work?",
        "Can you explain the concept of responsive web design and why it's important?",
        "Can you describe the process of testing and debugging software?",
        "What is caching and can you give an example?",
        "What is the difference between front-end development and a back-end development?",
        "How would you approach debugging a complex piece of code?",
        "What are some challenges you've faced when building web applications?",
        "Can you walk me through a recent project you worked on and your role in it?",
        "What is the difference between a class and an object?",
        "Describe your experience with database management and design.",
        "Can you describe a particularly challenging problem you solved?",
        "Can you explain recursion and provide an example?",
        "What is Big O notation and why is it important?",
        "What is an algorithm, and can you give an example of one?",
        "Explain any of the four fundamental concepts of object-oriented programming.",
        "What is an API and could you give an example of one?",
        "What is the difference between a stack and a queue?",
        "What is a pointer and how does it work?",
        "What is a hash table and how does it work?",
        "What is the difference between synchronous and asynchronous programming?",
        "How can you ensure performance and scalability of your code?",
        "What is an API and could you give an example of one?",
        "What are some methods you can optimize a website's performance?",
        "What is the purpose of a CDN?",
        "What is containerization and how does it work?",
        "What are the pros and cons of cloud computing services like AWS and Azure?",
        "What are the advantages of using cloud platforms to host, deploy, and scale applications?",
        "Explain the concept of big data.",
        "Explain the concept of edge computing.",
        "How does serverless computing work?"
    ],
    "technicalQuestions": [
        "webDevQuestions",
        "Can you explain why responsiveness and accessibility are important in web development?",
        "What is server-side rendering and why is it important?",
        "What are some pros and cons of hydration?",
        "backendDevQuestions",
        "How do you handle security concerns in backend development, such as protecting against SQL injection attacks or cross-site scripting (XSS)?",
        "Can you describe the design and use of microservices?",
        "Explain the usage and process of load testing.",
        "How do you handle data storage and retrieval in distributed systems?",
        "What is the difference between garbage collection and manual memory management?",
        "What is a runtime system and what are some features of one?",
        "devOpsQuestions",
        "What is the difference between a load balancer and a reverse proxy?",
        "Explain continuous integration and continuous delivery.",
        "What is IaC and how does it work?",
        "How can you ensure high availability and disaster recovery for your applications?",
        "dataScienceQuestions",
        "What is the difference between supervised and unsupervised learning?",
        "What is the difference between a regression and a classification problem?",
        "What are some ways to evaluate the performance of a machine learning model?",
        "Explain overfitting and ways you can prevent it.",
        "What is deep learning and how does it differ from traditional machine learning?"
    ]
}